TheWrew-Git/ProjectBookmark/RO4M1NG_L1BR4RY/ESP32/build_adafruit/sketch/RO4M1NG_L1BR4RY_adafruit.ino.cpp
#include <Arduino.h>
#line 1 "/home/wrew/code/ProjectBookmark/RO4M1NG_L1BR4RY/firmware/adafruit/RO4M1NG_L1BR4RY_adafruit/RO4M1NG_L1BR4RY_adafruit.ino"
#include <DNSServer.h>
#include <SPI.h>
#include <SD.h>
#include <Wire.h>

#include "../../../src/includes/utility/Sd2Card.h"
#define HAS_SD2CARD_HELPER 1

#ifndef PIN_LCD_CS
#define PIN_LCD_CS 42
#endif

#ifndef PIN_LCD_DC
#define PIN_LCD_DC 40
#endif

#ifndef PIN_LCD_RST
#define PIN_LCD_RST 41
#endif

#ifndef PIN_LCD_SCK
#define PIN_LCD_SCK 36
#endif

#ifndef PIN_LCD_MOSI
#define PIN_LCD_MOSI 35
#endif

#ifndef PIN_LCD_MISO
#define PIN_LCD_MISO -1
#endif

#ifndef PIN_LCD_BACKLIGHT
#define PIN_LCD_BACKLIGHT 45
#endif

#if defined(PIN_LCD_CS) && defined(PIN_LCD_DC)
#include <Adafruit_GFX.h>
#include <Adafruit_ST7789.h>
#include <Adafruit_MAX1704X.h>
#endif

#if defined(ARDUINO_ARCH_ESP32)
#include <WiFi.h>
#include <WebServer.h>
#elif defined(ARDUINO_ARCH_ESP8266)
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#else
#error "Unsupported architecture"
#endif
#include <map>
#include <vector>
#include <algorithm>

// Global Variables

// LED pin
const int ledPin = LED_BUILTIN;
bool ledState = false;

// Access Point settings
const char* serverName = "r04m1ng.l1br4ry";  // DNS name for captive portal
//const char* AP_SSID = "PR0J3K7_B00KM4RK";  // Name of the WiFi network
const char* AP_SSID_BASE = "PR0J3K7_B00KM4RK_";  // Base name for SSID
String AP_SSID;  // Full name with number
IPAddress apIP(192, 168, 4, 1);        // IP address of the NodeMCU in AP mode
const byte DNS_PORT = 53;              // DNS server port

#if defined(ARDUINO_ARCH_ESP32)
WebServer server(80);
#else
ESP8266WebServer server(80);
#endif
DNSServer dnsServer;

// SD card CS pin
#if defined(ARDUINO_ARCH_ESP32)
const int SD_CS_PIN = 10;
#else
const int SD_CS_PIN = D8;
#endif

// File Uploads
File uploadFile;

bool sdCardReady = false;

// Forum cleanup settings
unsigned long lastCleanupTime = 0;
const unsigned long CLEANUP_INTERVAL = 3600000; // 1 hour in milliseconds

// Forum structures
struct ForumPost {
  String id;
  String author;
  String content;
  String timestamp;
};

struct ForumThread {
  String id;
  String title;
  String author;
  String timestamp;
};

// Function declarations
void handleRoot();
void handleToggle();
void handleFileList();
void handleFileDownload();
void handleNotFound();
void handleCaptivePortal();
void handleForum();
void handleNewThread();
void handleThread();
void handleNewPost();
void checkAndCleanupForum();
void cleanupForum();
void removeDirectory(const char * path);
bool initializeSdCard();
bool ensureSdDirectory(const char* path, const char* description);
bool ensureSdFile(const char* path, const char* description, const char* defaultContent);
void finalizeChunkedResponse();

struct LibraryFileEntry {
  String path;
  size_t size;
};
//#define PIN_LCD_CS = 42;
//#define PIN_LCD_DC = 40;
//#define PIN_LCD_RST = 41;

#if defined(PIN_LCD_CS) && defined(PIN_LCD_DC)
#if defined(PIN_LCD_RST)
Adafruit_ST7789 tft(&SPI, PIN_LCD_CS, PIN_LCD_DC, PIN_LCD_RST);
#else
Adafruit_ST7789 tft(&SPI, PIN_LCD_CS, PIN_LCD_DC, -1);
#endif
Adafruit_MAX17048 batteryMonitor;
bool batteryMonitorInitialized = false;
bool batteryMonitorAvailable = false;
bool batteryMonitorWarningLogged = false;
unsigned long lastBatteryMonitorLog = 0;
uint8_t displayPage = 0;
const uint8_t DISPLAY_PAGE_COUNT = 2;
unsigned long lastButtonPoll = 0;
const unsigned long BUTTON_DEBOUNCE_MS = 200;
uint32_t lastButtonState = 0;
unsigned long lastLibraryMetricsUpdate = 0;
const unsigned long LIBRARY_METRICS_INTERVAL = 60000;
size_t libraryFileCount = 0;
uint64_t libraryTotalBytes = 0;
uint64_t sdTotalBytes = 0;
uint64_t sdUsedBytes = 0;
const uint8_t BUTTON_PREV_PIN = 0;   // D0 / BOOT
const uint8_t BUTTON_NEXT_PIN = 2;   // D2 button
const uint8_t BUTTON_WAKE_PIN = 1;   // D1 button
const uint8_t BUTTON_PREV_MASK = 0x01;
const uint8_t BUTTON_NEXT_MASK = 0x02;
const uint8_t BUTTON_WAKE_MASK = 0x04;
const unsigned long DISPLAY_SLEEP_TIMEOUT = 30000;
bool tftInitialized = false;
unsigned long lastDisplayUpdate = 0;
const unsigned long DISPLAY_UPDATE_INTERVAL = 1000;
bool displaySleeping = false;
unsigned long lastButtonActivity = 0;
#if defined(PIN_LCD_BACKLIGHT)
const bool HAS_LCD_BACKLIGHT = true;
#else
const bool HAS_LCD_BACKLIGHT = false;
#endif
#if defined(PIN_LCD_SCK) && defined(PIN_LCD_MOSI)
const bool HAS_LCD_SPI_PINS = true;
#else
const bool HAS_LCD_SPI_PINS = false;
#endif
#if defined(PIN_LCD_PWR)
const bool HAS_LCD_POWER_CTRL = true;
#else
const bool HAS_LCD_POWER_CTRL = false;
#endif
#if defined(PIN_LIPO_BATTERY)
const bool HAS_BATTERY_SENSE_PIN = true;
#else
const bool HAS_BATTERY_SENSE_PIN = false;
#endif
#endif

void collectLibraryFiles(const String& dirPath, std::vector<LibraryFileEntry>& files);
String humanReadableSize(size_t bytes);
String urlEncodePath(const String& path);
String formatTimestamp(unsigned long timestamp);
#if defined(PIN_LCD_CS) && defined(PIN_LCD_DC)
void initializeBatteryMonitor();
void setupDisplay();
void updateDisplay(bool force = false);
void renderDisplayHeader();
float readBatteryPercentage();
uint16_t batteryColorForPercentage(float percentage);
void handleDisplayButtons();
void updateLibraryMetrics();
void checkDisplaySleep();
void sleepDisplay();
void wakeDisplay(bool forceRefresh = false);
#endif

// Function to check if file is allowed
#line 210 "/home/wrew/code/ProjectBookmark/RO4M1NG_L1BR4RY/firmware/adafruit/RO4M1NG_L1BR4RY_adafruit/RO4M1NG_L1BR4RY_adafruit.ino"
bool isAllowedFile(const String& filename);
#line 229 "/home/wrew/code/ProjectBookmark/RO4M1NG_L1BR4RY/firmware/adafruit/RO4M1NG_L1BR4RY_adafruit/RO4M1NG_L1BR4RY_adafruit.ino"
bool isIp(String str);
#line 239 "/home/wrew/code/ProjectBookmark/RO4M1NG_L1BR4RY/firmware/adafruit/RO4M1NG_L1BR4RY_adafruit/RO4M1NG_L1BR4RY_adafruit.ino"
String toStringIp(IPAddress ip);
#line 248 "/home/wrew/code/ProjectBookmark/RO4M1NG_L1BR4RY/firmware/adafruit/RO4M1NG_L1BR4RY_adafruit/RO4M1NG_L1BR4RY_adafruit.ino"
bool captivePortal();
#line 613 "/home/wrew/code/ProjectBookmark/RO4M1NG_L1BR4RY/firmware/adafruit/RO4M1NG_L1BR4RY_adafruit/RO4M1NG_L1BR4RY_adafruit.ino"
void wakeDisplay(bool forceRefresh);
#line 682 "/home/wrew/code/ProjectBookmark/RO4M1NG_L1BR4RY/firmware/adafruit/RO4M1NG_L1BR4RY_adafruit/RO4M1NG_L1BR4RY_adafruit.ino"
void updateDisplay(bool force);
#line 940 "/home/wrew/code/ProjectBookmark/RO4M1NG_L1BR4RY/firmware/adafruit/RO4M1NG_L1BR4RY_adafruit/RO4M1NG_L1BR4RY_adafruit.ino"
void setup();
#line 1055 "/home/wrew/code/ProjectBookmark/RO4M1NG_L1BR4RY/firmware/adafruit/RO4M1NG_L1BR4RY_adafruit/RO4M1NG_L1BR4RY_adafruit.ino"
void loop();
#line 1223 "/home/wrew/code/ProjectBookmark/RO4M1NG_L1BR4RY/firmware/adafruit/RO4M1NG_L1BR4RY_adafruit/RO4M1NG_L1BR4RY_adafruit.ino"
void handleRedirect();
#line 1346 "/home/wrew/code/ProjectBookmark/RO4M1NG_L1BR4RY/firmware/adafruit/RO4M1NG_L1BR4RY_adafruit/RO4M1NG_L1BR4RY_adafruit.ino"
void handlePortal();
#line 1516 "/home/wrew/code/ProjectBookmark/RO4M1NG_L1BR4RY/firmware/adafruit/RO4M1NG_L1BR4RY_adafruit/RO4M1NG_L1BR4RY_adafruit.ino"
void handleNodeFiles();
#line 1766 "/home/wrew/code/ProjectBookmark/RO4M1NG_L1BR4RY/firmware/adafruit/RO4M1NG_L1BR4RY_adafruit/RO4M1NG_L1BR4RY_adafruit.ino"
void handleUploadPage();
#line 1883 "/home/wrew/code/ProjectBookmark/RO4M1NG_L1BR4RY/firmware/adafruit/RO4M1NG_L1BR4RY_adafruit/RO4M1NG_L1BR4RY_adafruit.ino"
void handleDisclaimer();
#line 1948 "/home/wrew/code/ProjectBookmark/RO4M1NG_L1BR4RY/firmware/adafruit/RO4M1NG_L1BR4RY_adafruit/RO4M1NG_L1BR4RY_adafruit.ino"
void handleFileUpload();
#line 2029 "/home/wrew/code/ProjectBookmark/RO4M1NG_L1BR4RY/firmware/adafruit/RO4M1NG_L1BR4RY_adafruit/RO4M1NG_L1BR4RY_adafruit.ino"
bool verifyUploadedFile(String filePath, size_t expectedSize);
#line 2062 "/home/wrew/code/ProjectBookmark/RO4M1NG_L1BR4RY/firmware/adafruit/RO4M1NG_L1BR4RY_adafruit/RO4M1NG_L1BR4RY_adafruit.ino"
void handleUpload();
#line 2309 "/home/wrew/code/ProjectBookmark/RO4M1NG_L1BR4RY/firmware/adafruit/RO4M1NG_L1BR4RY_adafruit/RO4M1NG_L1BR4RY_adafruit.ino"
void handleThreadAjax();
#line 210 "/home/wrew/code/ProjectBookmark/RO4M1NG_L1BR4RY/firmware/adafruit/RO4M1NG_L1BR4RY_adafruit/RO4M1NG_L1BR4RY_adafruit.ino"
bool isAllowedFile(const String& filename) {
  String lowerFilename = filename;
  lowerFilename.toLowerCase();
  return lowerFilename.endsWith(".pdf") ||
         lowerFilename.endsWith(".epub") ||
         lowerFilename.endsWith(".doc") ||
         lowerFilename.endsWith(".docx") ||
         lowerFilename.endsWith(".rtf") ||
         lowerFilename.endsWith(".txt") ||
         lowerFilename.endsWith(".azw") ||
         lowerFilename.endsWith(".mobi") ||
         lowerFilename.endsWith(".lib") ||
         lowerFilename.endsWith(".fb2") ||
         lowerFilename.endsWith(".prc") ||
         lowerFilename.endsWith(".pdb") ||
         lowerFilename.endsWith(".ibook");
}

