TheWrew-Git/ProjectBookmark/RO4M1NG_L1BR4RY/ESP32/build_adafruit/sketch/RO4M1NG_L1BR4RY_adafruit.ino.cpp
// Function to check if string is IP address
bool isIp(String str) {
  for (size_t i = 0; i < str.length(); i++) {
    int c = str.charAt(i);
    if (c != '.' && (c < '0' || c > '9')) {
      return false;
    }
  }
  return true;
}

String toStringIp(IPAddress ip) {
  String res = "";
  for (int i = 0; i < 3; i++) {
    res += String((ip >> (8 * i)) & 0xFF) + ".";
  }
  res += String(((ip >> 8 * 3)) & 0xFF);
  return res;
}

bool captivePortal() {
  if (!isIp(server.hostHeader())) {
    server.sendHeader("Location", String("http://") + toStringIp(apIP), true);
    server.send(302, "text/plain", "");
    return true;
  }
  return false;
}

bool ensureSdDirectory(const char* path, const char* description) {
  Serial.printf("[SD] Checking directory '%s' (%s)\n", path, description);
  if (SD.exists(path)) {
    File entry = SD.open(path);
    if (!entry) {
      Serial.printf("[SD][ERROR] Failed to open existing entry: %s\n", path);
      return false;
    }
    bool isDir = entry.isDirectory();
    entry.close();
    if (isDir) {
      Serial.println("[SD] Directory present");
      return true;
    }
    Serial.println("[SD][WARN] Path exists but is not a directory; removing");
    if (!SD.remove(path)) {
      Serial.println("[SD][ERROR] Failed to remove conflicting entry");
      return false;
    }
  } else {
    Serial.println("[SD] Directory missing; creating");
  }

  if (SD.mkdir(path)) {
    Serial.println("[SD] Directory ready");
    return true;
  }

  Serial.printf("[SD][ERROR] Failed to create directory: %s\n", path);
  return false;
}

bool ensureSdFile(const char* path, const char* description, const char* defaultContent) {
  Serial.printf("[SD] Checking file '%s' (%s)\n", path, description);
  if (SD.exists(path)) {
    File file = SD.open(path, FILE_READ);
    if (!file) {
      Serial.printf("[SD][ERROR] Failed to open existing file: %s\n", path);
      return false;
    }
    size_t size = file.size();
    file.close();
    Serial.printf("[SD] File present (%lu bytes)\n", static_cast<unsigned long>(size));
    if (size > 0) {
      return true;
    }
    Serial.println("[SD][WARN] File is empty; writing default content");
  } else {
    Serial.println("[SD] File missing; creating");
  }

  File file = SD.open(path, FILE_WRITE);
  if (!file) {
    Serial.printf("[SD][ERROR] Failed to open file for writing: %s\n", path);
    return false;
  }
  if (defaultContent) {
    file.print(defaultContent);
  }
  file.close();
  Serial.println("[SD] File ready");
  return true;
}

void finalizeChunkedResponse() {
#if defined(ARDUINO_ARCH_ESP32)
  server.sendContent("");
#else
  server.chunkedResponseFinalize();
#endif
}

String humanReadableSize(size_t bytes) {
  const char* suffixes[] = {"B", "KB", "MB", "GB"};
  double value = static_cast<double>(bytes);
  size_t suffixIndex = 0;
  while (value >= 1024.0 && suffixIndex < 3) {
    value /= 1024.0;
    ++suffixIndex;
  }
  int decimals = value < 10.0 ? 2 : 1;
  return String(value, decimals) + " " + suffixes[suffixIndex];
}

String urlEncodePath(const String& path) {
  const char hex[] = "0123456789ABCDEF";
  String encoded;
  encoded.reserve(path.length() * 3);
  for (size_t i = 0; i < path.length(); ++i) {
    uint8_t c = static_cast<uint8_t>(path.charAt(i));
    if ((c >= 'a' && c <= 'z') || (c >= 'A' && c <= 'Z') || (c >= '0' && c <= '9') ||
        c == '-' || c == '_' || c == '.' || c == '~' || c == '/') {
      encoded += static_cast<char>(c);
    } else {
      encoded += '%';
      encoded += hex[(c >> 4) & 0x0F];
      encoded += hex[c & 0x0F];
    }
  }
  return encoded;
}

String formatTimestamp(unsigned long timestamp) {
  unsigned long now = millis();
  unsigned long diff = now >= timestamp ? now - timestamp : 0;

  if (diff < 60000UL) {
    return String(diff / 1000UL) + "s ago";
  }
  if (diff < 3600000UL) {
    return String(diff / 60000UL) + "m ago";
  }
  if (diff < 86400000UL) {
    return String(diff / 3600000UL) + "h ago";
  }
  return String(diff / 86400000UL) + "d ago";
}

#if defined(PIN_LCD_CS) && defined(PIN_LCD_DC)
void initializeBatteryMonitor() {
  if (batteryMonitorInitialized) {
    return;
  }

  batteryMonitorInitialized = true;

#if defined(TFT_I2C_POWER)
  pinMode(TFT_I2C_POWER, OUTPUT);
  digitalWrite(TFT_I2C_POWER, HIGH);
  Serial.println("[BATT] TFT_I2C_POWER enabled");
#endif

  Wire.begin(SDA, SCL);
  Serial.println("[BATT] Initializing MAX17048 battery monitor");
  if (batteryMonitor.begin(&Wire)) {
    batteryMonitorAvailable = true;
    batteryMonitor.quickStart();
    Serial.println("[BATT] MAX17048 battery monitor ready");
  } else {
    Serial.println("[BATT][WARN] MAX17048 battery monitor not detected");
  }
}

float readBatteryPercentage() {
  unsigned long now = millis();

  if (batteryMonitorAvailable) {
    float voltage = batteryMonitor.cellVoltage();
    float percentage = constrain(batteryMonitor.cellPercent(), 0.0f, 100.0f);
    if (now - lastBatteryMonitorLog >= 10000UL) {
      Serial.printf("[BATT] MAX17048 -> %.3f V / %.1f%%\n", voltage, percentage);
      lastBatteryMonitorLog = now;
    }
    return percentage;
  }

#if defined(PIN_LIPO_BATTERY)
#if defined(ARDUINO_ARCH_ESP32)
  uint16_t millivolts = analogReadMilliVolts(PIN_LIPO_BATTERY);
#else
  int raw = analogRead(PIN_LIPO_BATTERY);
  float millivolts = (static_cast<float>(raw) * (3300.0f / 1023.0f));
#endif
  const float minMv = 3300.0f;
  const float maxMv = 4200.0f;
  float normalized = (static_cast<float>(millivolts) - minMv) / (maxMv - minMv);
  normalized = constrain(normalized, 0.0f, 1.0f);
  float percentage = normalized * 100.0f;
  if (now - lastBatteryMonitorLog >= 10000UL) {
    Serial.printf("[BATT] Analog %u mV -> %.1f%%\n", static_cast<unsigned int>(millivolts), percentage);
    lastBatteryMonitorLog = now;
  }
  return percentage;
#else
  if (!batteryMonitorWarningLogged) {
    Serial.println("[BATT][WARN] Battery percentage unavailable (no monitor or sense pin)");
    batteryMonitorWarningLogged = true;
  }
  return -1.0f;
#endif
}

