TheWrew-Git/ProjectBookmark/RO4M1NG_L1BR4RY/ESP32/build_adafruit/sketch/RO4M1NG_L1BR4RY_adafruit.ino.cpp
void setupDisplay() {
  if (tftInitialized) {
    Serial.println("[TFT] setupDisplay skipped (already initialized)");
    return;
  }

  Serial.println("[TFT] setupDisplay starting");
  Serial.printf("[TFT] Pins -> CS:%d DC:%d", PIN_LCD_CS, PIN_LCD_DC);
#if defined(PIN_LCD_RST)
  Serial.printf(" RST:%d", PIN_LCD_RST);
#else
  Serial.print(" RST:<none>");
#endif
#if defined(PIN_LCD_BACKLIGHT)
  Serial.printf(" BL:%d", PIN_LCD_BACKLIGHT);
#endif
#if defined(PIN_LCD_PWR)
  Serial.printf(" PWR:%d", PIN_LCD_PWR);
#endif
  Serial.println();

#if defined(PIN_LCD_PWR)
  Serial.println("[TFT] Enabling display power rail");
  pinMode(PIN_LCD_PWR, OUTPUT);
  digitalWrite(PIN_LCD_PWR, HIGH);
#else
  Serial.println("[TFT] No dedicated display power pin");
#endif

  if (HAS_LCD_BACKLIGHT) {
    pinMode(PIN_LCD_BACKLIGHT, OUTPUT);
    digitalWrite(PIN_LCD_BACKLIGHT, HIGH);
    Serial.println("[TFT] Backlight enabled");
  } else {
    Serial.println("[TFT] Backlight control pin missing");
  }

#if defined(ARDUINO_ARCH_ESP32) && defined(PIN_LIPO_BATTERY)
  analogReadResolution(12);
  analogSetAttenuation(ADC_11db);
  Serial.println("[TFT] Battery ADC configured for ESP32");
#elif defined(PIN_LIPO_BATTERY)
  Serial.println("[TFT] Battery ADC uses default resolution");
#endif

#if defined(PIN_LCD_SCK) && defined(PIN_LCD_MOSI)
  Serial.println("[TFT] Initiating SPI bus for TFT");
  int tftMisoPin = -1;
#if defined(PIN_LCD_MISO)
  tftMisoPin = PIN_LCD_MISO;
#endif
  SPI.begin(PIN_LCD_SCK, tftMisoPin, PIN_LCD_MOSI, PIN_LCD_CS);
#else
  Serial.println("[TFT] Using default SPI bus for TFT");
#endif

  digitalWrite(SD_CS_PIN, HIGH);
  Serial.println("[TFT] Claiming bus and initializing ST7789");
  tft.init(135, 240);
  tft.setRotation(1);
  tft.fillScreen(ST77XX_BLACK);
  tft.setTextWrap(false);
  tft.setTextSize(2);
  renderDisplayHeader();
  tftInitialized = true;
  displaySleeping = false;
  lastButtonActivity = millis();
  updateDisplay(true);
}

void renderDisplayHeader() {
  tft.fillRect(0, 0, 240, 60, ST77XX_BLACK);
  tft.setTextSize(2);
  tft.setTextColor(ST77XX_GREEN, ST77XX_BLACK);
  tft.setCursor(10, 15);
  tft.print("PR0J3KT");
  tft.setCursor(10, 35);
  tft.print("B00KM4RK");
  tft.drawFastHLine(10, 55, 220, ST77XX_GREEN);
  Serial.println("[TFT] Header rendered");
}

void handleDisplayButtons() {
  unsigned long now = millis();
  if (now - lastButtonPoll < BUTTON_DEBOUNCE_MS) {
    return;
  }
  lastButtonPoll = now;

  uint32_t state = 0;
  if (digitalRead(BUTTON_PREV_PIN) == LOW) {
    state |= BUTTON_PREV_MASK;
  }
  if (digitalRead(BUTTON_NEXT_PIN) == HIGH) {
    state |= BUTTON_NEXT_MASK;
  }
  if (digitalRead(BUTTON_WAKE_PIN) == HIGH) {
    state |= BUTTON_WAKE_MASK;
  }

  if (state == lastButtonState) {
    return;
  }
  lastButtonState = state;

  if (state == 0) {
    return;
  }

  if (displaySleeping) {
    if (state & BUTTON_WAKE_MASK) {
      Serial.println("[TFT] Wake button pressed (D1)");
      wakeDisplay(true);
    }
    return;
  }

  lastButtonActivity = now;

  if (state & BUTTON_WAKE_MASK) {
    Serial.println("[TFT] Wake button pressed while awake (D1)");
    return;
  }

  if (state & BUTTON_PREV_MASK) {
    if (displayPage == 0) {
      displayPage = DISPLAY_PAGE_COUNT - 1;
    } else {
      displayPage--;
    }
    Serial.printf("[TFT] Display page changed to %u (D0)\n", displayPage);
    updateDisplay(true);
    return;
  }

  if (state & BUTTON_NEXT_MASK) {
    displayPage = (displayPage + 1) % DISPLAY_PAGE_COUNT;
    Serial.printf("[TFT] Display page changed to %u (D2)\n", displayPage);
    updateDisplay(true);
  }
}

void checkDisplaySleep() {
  if (displaySleeping) {
    return;
  }

  unsigned long now = millis();
  if (now >= lastButtonActivity) {
    if (now - lastButtonActivity >= DISPLAY_SLEEP_TIMEOUT) {
      Serial.println("[TFT] Sleep timeout reached");
      sleepDisplay();
    }
  } else if (((UINT32_MAX - lastButtonActivity) + now) >= DISPLAY_SLEEP_TIMEOUT) {
    Serial.println("[TFT] Sleep timeout reached (wrap)");
    sleepDisplay();
  }
}

void sleepDisplay() {
  if (displaySleeping) {
    return;
  }

  displaySleeping = true;
  Serial.println("[TFT] Entering display sleep");
  if (tftInitialized) {
    tft.fillScreen(ST77XX_BLACK);
  }
#if defined(PIN_LCD_BACKLIGHT)
  digitalWrite(PIN_LCD_BACKLIGHT, LOW);
#endif
}

void wakeDisplay(bool forceRefresh) {
  bool wasSleeping = displaySleeping;
  displaySleeping = false;
  if (wasSleeping) {
    Serial.println("[TFT] Waking display");
  }
#if defined(PIN_LCD_BACKLIGHT)
  digitalWrite(PIN_LCD_BACKLIGHT, HIGH);
#endif
  lastButtonActivity = millis();
  if (wasSleeping) {
    renderDisplayHeader();
  }
  if (forceRefresh || wasSleeping) {
    updateDisplay(true);
  }
}

void updateLibraryMetrics() {
  lastLibraryMetricsUpdate = millis();
  libraryFileCount = 0;
  libraryTotalBytes = 0;

  if (!sdCardReady) {
    Serial.println("[SD][WARN] Cannot update library metrics; SD not ready");
    return;
  }

  std::vector<LibraryFileEntry> entries;
  collectLibraryFiles("/Alexandria", entries);
  libraryFileCount = entries.size();
  for (const auto &entry : entries) {
    libraryTotalBytes += entry.size;
  }

  if (SD.cardSize()) {
    uint64_t total = static_cast<uint64_t>(SD.cardSize()) * 512ULL;
    uint64_t used = total;
    if (SD.totalBytes()) {
      total = SD.totalBytes();
      used = SD.usedBytes();
    } else {
      fs::File root = SD.open("/");
      if (root) {
        std::vector<LibraryFileEntry> allFiles;
        collectLibraryFiles("/", allFiles);
        uint64_t calculatedUsed = 0;
        for (const auto &entry : allFiles) {
          calculatedUsed += entry.size;
        }
        used = calculatedUsed;
      }
    }

    sdTotalBytes = total;
    sdUsedBytes = std::min<uint64_t>(used, total);
  } else {
    sdTotalBytes = 0;
    sdUsedBytes = 0;
  }

  Serial.printf("[SD] Library files: %u, total size: %llu bytes\n",
                static_cast<unsigned int>(libraryFileCount),
                static_cast<unsigned long long>(libraryTotalBytes));
  Serial.printf("[SD] Card total: %llu bytes, used: %llu bytes\n",
                static_cast<unsigned long long>(sdTotalBytes),
                static_cast<unsigned long long>(sdUsedBytes));
}

void updateDisplay(bool force) {
  if (displaySleeping && !force) {
    return;
  }

  if (!tftInitialized) {
    Serial.println("[TFT] updateDisplay called before setup");
    return;
  }

  unsigned long now = millis();
  if (!force) {
    if (now >= lastDisplayUpdate) {
      if (now - lastDisplayUpdate < DISPLAY_UPDATE_INTERVAL) {
        return;
      }
    } else if ((UINT32_MAX - lastDisplayUpdate) + now < DISPLAY_UPDATE_INTERVAL) {
      return;
    }
  }

