TheWrew-Git/ProjectBookmark/RO4M1NG_L1BR4RY/ESP32/build_adafruit/sketch/RO4M1NG_L1BR4RY_adafruit.ino.cpp
  lastDisplayUpdate = now;
  digitalWrite(SD_CS_PIN, HIGH);
  Serial.println("[TFT] Updating display contents");

  const int contentX = 10;
  const int batteryY = 70;
  const int barX = 10;
  const int barY = 95;
  const int barWidthMax = 200;
  const int barHeight = 15;
  const int clientsY = 120;
  const int filesY = 70;
  const int storageBarY = 95;
  const int storageBarHeight = 15;
  const int storageBarWidth = 200;
  const int storageTextY = 120;

  tft.fillRect(0, 60, 240, 80, ST77XX_BLACK);
  tft.setTextSize(2);

  if (displayPage == 0) {
    float batteryPercent = readBatteryPercentage();
    if (batteryPercent < 0.0f) {
      tft.setTextColor(ST77XX_RED, ST77XX_BLACK);
      tft.setCursor(contentX, batteryY);
      tft.print("BATT: --");
      Serial.println("[TFT] Battery percentage unavailable");
    } else {
      uint16_t batteryColor = batteryColorForPercentage(batteryPercent);
      tft.setTextColor(batteryColor, ST77XX_BLACK);
      tft.setCursor(contentX, batteryY);
      tft.printf("BATT: %3.0f%%", batteryPercent);
      int filled = static_cast<int>((batteryPercent / 100.0f) * barWidthMax + 0.5f);
      filled = constrain(filled, 0, barWidthMax);
      tft.drawRect(barX, barY, barWidthMax + 2, barHeight + 2, batteryColor);
      if (filled > 0) {
        tft.fillRect(barX + 1, barY + 1, filled, barHeight, batteryColor);
      }
      if (filled < barWidthMax) {
        tft.fillRect(barX + 1 + filled, barY + 1, barWidthMax - filled, barHeight, ST77XX_BLACK);
      }
      Serial.printf("[TFT] Battery bar width: %d/%d\n", filled, barWidthMax);
    }

    tft.setTextColor(ST77XX_YELLOW, ST77XX_BLACK);
    tft.setCursor(contentX, clientsY);
    int clientCount = WiFi.softAPgetStationNum();
    tft.printf("CL13N75: %d", clientCount);
    Serial.printf("[TFT] Client count: %d\n", clientCount);
  } else {
    if (millis() - lastLibraryMetricsUpdate > LIBRARY_METRICS_INTERVAL) {
      updateLibraryMetrics();
    }

    tft.setTextColor(ST77XX_CYAN, ST77XX_BLACK);
    tft.setCursor(contentX, filesY);
    tft.printf("Files: %u", static_cast<unsigned int>(libraryFileCount));

    uint16_t barColor = ST77XX_CYAN;
    if (sdTotalBytes > 0) {
      float usage = static_cast<float>(sdUsedBytes) / static_cast<float>(sdTotalBytes);
      usage = constrain(usage, 0.0f, 1.0f);
      int filled = static_cast<int>((1.0f - usage) * storageBarWidth + 0.5f);
      filled = constrain(filled, 0, storageBarWidth);
      tft.drawRect(barX, storageBarY, storageBarWidth + 2, storageBarHeight + 2, barColor);
      if (filled > 0) {
        tft.fillRect(barX + 1, storageBarY + 1, filled, storageBarHeight, barColor);
      }
      if (filled < storageBarWidth) {
        tft.fillRect(barX + 1 + filled, storageBarY + 1, storageBarWidth - filled, storageBarHeight, ST77XX_BLACK);
      }

      float freePercent = (sdTotalBytes > 0)
                          ? (100.0f * static_cast<float>(sdTotalBytes - sdUsedBytes) / static_cast<float>(sdTotalBytes))
                          : 0.0f;
      tft.setCursor(contentX, storageTextY);
      tft.printf("SD Free: %3.0f%%", freePercent);
      Serial.printf("[SD] Free %.1f%%\n", freePercent);
    } else {
      tft.setTextColor(ST77XX_RED, ST77XX_BLACK);
      tft.setCursor(contentX, storageTextY);
      tft.print("SD Stats Unavailable");
    }
  }
}

uint16_t batteryColorForPercentage(float percentage) {
  if (percentage >= 80.0f) {
    return ST77XX_GREEN;
  }
  if (percentage >= 60.0f) {
    return tft.color565(144, 238, 144); // light green
  }
  if (percentage >= 40.0f) {
    return ST77XX_YELLOW;
  }
  if (percentage >= 25.0f) {
    return ST77XX_ORANGE;
  }
  return ST77XX_RED;
}
#endif

void collectLibraryFiles(const String& dirPath, std::vector<LibraryFileEntry>& files) {
  File dir = SD.open(dirPath.c_str());
  if (!dir) {
    return;
  }
  if (!dir.isDirectory()) {
    dir.close();
    return;
  }

  while (true) {
    File entry = dir.openNextFile();
    if (!entry) {
      break;
    }

    String name = entry.name();
    bool isDir = entry.isDirectory();
    size_t entrySize = entry.size();
    String entryPath;
    if (dirPath == "/") {
      entryPath = "/" + name;
    } else if (dirPath.endsWith("/")) {
      entryPath = dirPath + name;
    } else {
      entryPath = dirPath + "/" + name;
    }
    entry.close();

    String lowerPath = entryPath;
    lowerPath.toLowerCase();

    if (isDir) {
      if (lowerPath == "/forum" || lowerPath.startsWith("/forum/")) {
        continue;
      }
      collectLibraryFiles(entryPath, files);
    } else if (isAllowedFile(name)) {
      files.push_back({entryPath, entrySize});
    }
  }

  dir.close();
}

bool initializeSdCard() {
  Serial.println("[SD] ----- Initialization Start -----");
  Serial.printf("[SD] Configured CS pin: %d\n", SD_CS_PIN);
  Serial.println("[SD] Attempting to mount card...");

  pinMode(SD_CS_PIN, OUTPUT);
  digitalWrite(SD_CS_PIN, HIGH);

#if defined(ARDUINO_ARCH_ESP32)
  SPI.begin(SCK, MISO, MOSI, SD_CS_PIN);
#else
  SPI.begin();
#endif

  //#if HAS_SD2CARD_HELPER
  //    Serial.println("[SD] Performing low-level card.init verification (SPI_HALF_SPEED)");
  //    Sd2Card card;
  //    if (!card.init(SPI_HALF_SPEED, SD_CS_PIN)) {
  //        Serial.printf("[SD][ERROR] card.init failed (code=%u, data=%u)\n", card.errorCode(), card.errorData());
  //        Serial.println("[SD][HINT] Check wiring, ensure the card is inserted, and verify CS pin wiring");
  //        Serial.println("[SD] ----- Initialization Aborted -----");
  //        return false;
  //   }

  // const uint8_t detectedType = card.type();
  //const char* typeLabel = "Unknown";
  //switch (detectedType) {
  //   case SD_CARD_TYPE_SD1:
  //      typeLabel = "SD1";
  //     break;
  //  case SD_CARD_TYPE_SD2:
  //     typeLabel = "SD2";
  //     break;
  // case SD_CARD_TYPE_SDHC:
  //     typeLabel = "SDHC";
  //     break;
  //  default:
  //      break;
  // }

  //   Serial.printf("[SD] card.init succeeded; detected type: %s\n", typeLabel);
  //#else
  //   Serial.println("[SD][WARN] card.init helper unavailable; skipping low-level verification");
  //#endif

