TheWrew-Git/ProjectBookmark/RO4M1NG_L1BR4RY/ESP32/build_adafruit/sketch/RO4M1NG_L1BR4RY_adafruit.ino.cpp
  if (!SD.begin(SD_CS_PIN)) {
    Serial.println("[SD][ERROR] SD.begin failed; card not available");
    Serial.println("[SD] ----- Initialization Aborted -----");
    return false;
  }

  Serial.println("[SD] Card mounted successfully");

  enum SdRequirementType { SD_REQ_DIRECTORY, SD_REQ_FILE };

  struct SdRequirement {
    const char* path;
    SdRequirementType type;
    const char* description;
    const char* defaultContent;
  };

  const SdRequirement requirements[] = {
    {"/forum", SD_REQ_DIRECTORY, "Forum root directory", nullptr},
    {"/forum/posts", SD_REQ_DIRECTORY, "Forum posts directory", nullptr},
    {"/forum/threads.json", SD_REQ_FILE, "Forum threads index", "[]\n"}
  };

  bool allOk = true;
  for (const auto& requirement : requirements) {
    Serial.printf("[SD] Verifying %s (%s)\n",
                  requirement.path,
                  requirement.type == SD_REQ_DIRECTORY ? "directory" : "file");

    bool result = requirement.type == SD_REQ_DIRECTORY
                  ? ensureSdDirectory(requirement.path, requirement.description)
                  : ensureSdFile(requirement.path, requirement.description, requirement.defaultContent);

    if (!result) {
      allOk = false;
      Serial.printf("[SD][ERROR] Requirement failed: %s\n", requirement.path);
    }
  }

  Serial.println(allOk ? "[SD] All requirements satisfied" : "[SD][WARN] Some requirements failed; review logs");
  Serial.println("[SD] ----- Initialization Complete -----");
  return allOk;
}

void setup() {
  // Start Serial for debugging
  Serial.begin(115200);
  delay(100);
#if defined(ARDUINO_ARCH_ESP32)
  unsigned long serialWaitStart = millis();
  while (!Serial && (millis() - serialWaitStart) < 5000) {
    delay(10);
  }
  if (Serial) {
    Serial.println();
    Serial.println("[SYS] USB serial connected");
  }
#endif
  Serial.println("\nStarting setup...");

  // Initialize LED pin
  pinMode(ledPin, OUTPUT);
  digitalWrite(ledPin, LOW);

  // Initialize SD card and verify structure
  sdCardReady = initializeSdCard();
  if (!sdCardReady) {
    Serial.println("[SD][WARN] SD card initialization failed; storage features unavailable");
  }

  // Set up Access Point
  randomSeed(analogRead(0));  // Initialize random seed
  int randomNum = random(0, 100);  // Generate random number 0-99
  AP_SSID = String(AP_SSID_BASE) + String(randomNum < 10 ? "0" : "") + String(randomNum);
  Serial.println("Generated SSID: " + AP_SSID);

  WiFi.mode(WIFI_AP);
  WiFi.softAPConfig(apIP, apIP, IPAddress(255, 255, 255, 0));

  // Start AP without password
  bool apStartSuccess = WiFi.softAP(AP_SSID.c_str(), NULL, 1);
  Serial.println(apStartSuccess ? "AP Start Success" : "AP Start Failed!");

  if (apStartSuccess) {
    Serial.println("Access Point Started Successfully");
    Serial.printf("SSID: %s\n", AP_SSID.c_str());
    Serial.printf("AP IP address: %s\n", WiFi.softAPIP().toString().c_str());
  }

  // Configure DNS server to redirect all requests
  dnsServer.setErrorReplyCode(DNSReplyCode::NoError);
  dnsServer.start(DNS_PORT, "*", apIP);

  // Set up server routes
  server.on("/", handleRoot); //Main library page
  server.on("/toggle", handleToggle);
  server.on("/list", handleFileList);
  server.on("/download", handleFileDownload);
  server.on("/forum", handleForum);
  server.on("/forum/new", handleNewThread);
  server.on("/forum/thread", handleThread);
  server.on("/forum/post", handleNewPost);
  server.on("/thread", HTTP_GET, handleThreadAjax);
  server.on("/upload", HTTP_POST, handleUpload, handleFileUpload);
  server.on("/node-files", handleNodeFiles);
  server.on("/uploadpage", handleUploadPage); server.on("/", handleRoot);            // Main library page
  // server.on("/generate_204", handleCaptivePortal);  // Android
  //server.on("/gen_204", handleCaptivePortal);       // Android
  //server.on("/ncsi.txt", handleCaptivePortal);      // Windows
  //server.on("/check_network_status.txt", handleCaptivePortal);  // Windows
  //server.on("/hotspot-detect.html", handleCaptivePortal);    // iOS
  //server.on("/success.txt", handleCaptivePortal);           // iOS
  //server.on("/connecttest.txt", handleCaptivePortal);       // Windows
  //server.onNotFound(handleNotFound);                       // All other requests

  // Routes for Captive Portal detection
  server.on("/", handlePortal);
  server.on("/fwlink", handlePortal);
  server.on("/generate_204", handlePortal);
  server.on("/hotspot-detect.html", handlePortal);
  server.onNotFound(handlePortal);

  // Add handlers for different captive portal detection
  server.on("/", []() {
    if (captivePortal()) {
      return;
    }
    handlePortal();
  });

  server.onNotFound([]() {
    if (captivePortal()) {
      return;
    }
    handlePortal();
  });

  server.begin();
  Serial.println("HTTP server started");

  // Initialize cleanup timer
  lastCleanupTime = millis();

#if defined(PIN_LCD_CS) && defined(PIN_LCD_DC)
  initializeBatteryMonitor();
  setupDisplay();
  updateLibraryMetrics();
  pinMode(BUTTON_PREV_PIN, INPUT_PULLUP);
#if defined(ARDUINO_ARCH_ESP32)
  pinMode(BUTTON_NEXT_PIN, INPUT_PULLDOWN);
#else
  pinMode(BUTTON_NEXT_PIN, INPUT);
#endif
  pinMode(BUTTON_WAKE_PIN, INPUT_PULLDOWN);
#else
  Serial.println("[TFT] Display pins not defined for this board configuration");
#endif
}

void loop() {
  dnsServer.processNextRequest();   // DNS
  server.handleClient();    //HTTP
  checkAndCleanupForum();
#if defined(PIN_LCD_CS) && defined(PIN_LCD_DC)
  handleDisplayButtons();
  updateDisplay();
  checkDisplaySleep();
#endif
}

void checkAndCleanupForum() {
  unsigned long currentTime = millis();
  if ((currentTime - lastCleanupTime >= CLEANUP_INTERVAL) || (currentTime < lastCleanupTime)) {
    cleanupForum();
    lastCleanupTime = currentTime;
  }
}

void cleanupForum() {
  if (!sdCardReady) {
    Serial.println("[SD][WARN] Skipping forum cleanup; SD card unavailable");
    return;
  }
  if (SD.exists("/forum")) {
    removeDirectory("/forum");
  }

  SD.mkdir("/forum");
  SD.mkdir("/forum/posts");

