TheWrew-Git/ProjectBookmark/RO4M1NG_L1BR4RY/ESP32/build_adafruit/sketch/RO4M1NG_L1BR4RY_adafruit.ino.cpp
  File threadsFile = SD.open("/forum/threads.json", FILE_WRITE);
  if (threadsFile) {
    threadsFile.println("[]");
    threadsFile.close();
  }

  File logFile = SD.open("/forum/cleanup.log", FILE_WRITE);
  if (logFile) {
    logFile.printf("Forum cleaned at: %lu\n", millis());
    logFile.close();
  }
}

void removeDirectory(const char * path) {
  File dir = SD.open(path);
  if (!dir.isDirectory()) {
    return;
  }

  while (true) {
    File entry = dir.openNextFile();
    if (!entry) {
      break;
    }

    String entryPath = String(path) + "/" + entry.name();

    if (entry.isDirectory()) {
      entry.close();
      removeDirectory(entryPath.c_str());
    } else {
      entry.close();
      SD.remove(entryPath.c_str());
    }
  }
  dir.close();
  SD.rmdir(path);
}


//WEB HANDLERS
void handleRoot() {
    // Add headers for captive portal
    server.sendHeader("Cache-Control", "no-cache, no-store, must-revalidate");
    server.sendHeader("Pragma", "no-cache");
    server.sendHeader("Expires", "-1");
    
    // Create a simpler, more robust HTML string
    String html = "<!DOCTYPE html><html><head>";
    html += "<meta name='viewport' content='width=device-width, initial-scale=1'>";
    html += "<style>";
    // Simple but effective cyberpunk styling
    html += "body{background-color:#000;color:#0f0;font-family:'Courier New',monospace;margin:0;padding:0;display:flex;justify-content:center;align-items:center;min-height:100vh;overflow-x:hidden}";
    html += "h1,h2,h3{color:#0f0;text-shadow:0 0 5px #0f0;text-transform:uppercase;text-align:center}";
    html += "a{color:#0f0;text-decoration:none}";
    html += "a:hover{color:#fff;text-shadow:0 0 6px #0f0}";
    html += ".container{border:1px solid #0f0;width:90%;max-width:800px;margin:20px;padding:20px;box-shadow:0 0 15px #0f0;position:relative;z-index:1;background:rgba(0,5,0,0.7)}";
    html += ".status{border-left:3px solid #0f0;padding:10px;margin:15px auto;text-align:center;width:80%;max-width:500px;transition:all 0.3s ease}";
    html += ".status:hover{transform:translateY(-3px);box-shadow:0 0 8px rgba(0,255,0,0.7)}";
    
    // Cyberpunk grid background
    html += ".cyber-grid{position:fixed;top:0;left:0;right:0;bottom:0;background:linear-gradient(rgba(0,15,0,0.2) 1px, transparent 1px),linear-gradient(90deg, rgba(0,15,0,0.2) 1px, transparent 1px);background-size:20px 20px;z-index:-1}";
    
    // Scanning effect
    html += ".cyber-scan{position:fixed;top:0;left:0;right:0;height:3px;background:rgba(0,255,0,0.5);box-shadow:0 0 10px #0f0;animation:scan 20s linear infinite;z-index:0}";
    html += "@keyframes scan{0%{top:0}100%{top:100%}}";
    
    // Restored Glitch Text Effect
    html += ".glitch-wrapper{padding:20px;text-align:center;margin-bottom:20px;position:relative}";
    html += ".glitch{font-size:2.5em;font-weight:bold;text-transform:uppercase;position:relative;text-shadow:0.05em 0 0 #00fffc,-0.03em -0.04em 0 #fc00ff,0.025em 0.04em 0 #fffc00;animation:glitch 725ms infinite}";
    html += ".glitch span{position:absolute;top:0;left:0;width:100%}";
    html += ".glitch span:first-child{animation:glitch 500ms infinite;clip-path:polygon(0 0,100% 0,100% 35%,0 35%);transform:translate(-0.04em,-0.03em);opacity:0.75}";
    html += ".glitch span:last-child{animation:glitch 375ms infinite;clip-path:polygon(0 65%,100% 65%,100% 100%,0 100%);transform:translate(0.04em,0.03em);opacity:0.75}";
    
    // Glitch animation keyframes
    html += "@keyframes glitch{0%{text-shadow:0.05em 0 0 #00fffc,-0.03em -0.04em 0 #fc00ff,0.025em 0.04em 0 #fffc00}15%{text-shadow:0.05em 0 0 #00fffc,-0.03em -0.04em 0 #fc00ff,0.025em 0.04em 0 #fffc00}16%{text-shadow:-0.05em -0.025em 0 #00fffc,0.025em 0.035em 0 #fc00ff,-0.05em -0.05em 0 #fffc00}49%{text-shadow:-0.05em -0.025em 0 #00fffc,0.025em 0.035em 0 #fc00ff,-0.05em -0.05em 0 #fffc00}50%{text-shadow:0.05em 0.035em 0 #00fffc,0.03em 0 0 #fc00ff,0 -0.04em 0 #fffc00}99%{text-shadow:0.05em 0.035em 0 #00fffc,0.03em 0 0 #fc00ff,0 -0.04em 0 #fffc00}100%{text-shadow:-0.05em 0 0 #00fffc,-0.025em -0.04em 0 #fc00ff,-0.04em -0.025em 0 #fffc00}}";
    
    html += "</style></head><body>";

    // Background elements
    html += "<div class='cyber-grid'></div><div class='cyber-scan'></div>";

    // Main content
    html += "<div class='container'>";
    
    // Restored glitch title with spans for effect
    html += "<div class='glitch-wrapper'>";
    html += "<div class='glitch'>7H3 R04M1NG L1BR4RY";
    html += "<span>7H3 R04M1NG L1BR4RY</span>";
    html += "<span>7H3 R04M1NG L1BR4RY</span>";
    html += "</div>";
    html += "</div>";
    
    // ASCII Owl
    html += "<pre style='color:#0f0;text-align:center;line-height:1.2;margin:20px auto;font-size:18px'>";
    html += "      ,___,\n     (O,O)\n     (  v  )\n    -==*^*==-\n";
    html += "</pre>";
    
    // Menu options
   html += "<div class='status' style='position:relative'>";
    html += "<h3><a href='/node-files?node=" + AP_SSID + "' style='text-decoration:underline'> ** 74k3-4-F1L3 ** </a></h3>";
    html += "<div style='position:absolute;right:0;top:0;bottom:0;width:3px;background:#0f0;box-shadow:0 0 6px #0f0;'></div>";
    html += "</div>";

    html += "<div class='status' style='position:relative'>";
    html += "<h3><a href='/uploadpage' style='text-decoration:underline'> ** L34V3-4-F1L3 ** </a></h3>";
    html += "<div style='position:absolute;right:0;top:0;bottom:0;width:3px;background:#0f0;box-shadow:0 0 6px #0f0;'></div>";
    html += "</div>";

    html += "<div class='status' style='position:relative'>";
    html += "<h3><a href='/forum' style='text-decoration:underline'> ** P057-2-F0RUM ** </a></h3>";
    html += "<div style='position:absolute;right:0;top:0;bottom:0;width:3px;background:#0f0;box-shadow:0 0 6px #0f0;'></div>";
    html += "</div>";
    
    //buffer space
    html += "<div style='height:40px;'></div>"; 

    // System status
    html += "<div style='text-align:center;margin-top:20px'>";
    html += "[ System Status: " + String(ledState ? "ACTIVE" : "Rebel") + " ]";
    html += "</div>";

    //buffer space
    html += "<div style='height:80px;'></div>"; 

    // Disclaimer link in bottom right
    html += "<div style='position:absolute;bottom:10px;right:10px;font-size:0.9em;text-align:right'>";
    html += "<a href='/disclaimer' style='text-decoration:underline;color:#fff'>DISCLAIMER</a>";
    html += "</div>";
    
    html += "</div>"; // Close container
    html += "</body></html>";

    // Send the response
    server.send(200, "text/html", html);
}

void handleRedirect() {
  // Send a simple HTML page with JavaScript redirection
  String html = "<!DOCTYPE html><html><head>";
  html += "<script>window.location.replace('http://" + toStringIp(apIP) + "');</script>";
  html += "<meta http-equiv='refresh' content='0;url=http://" + toStringIp(apIP) + "'>";
  html += "</head><body>";
  html += "<p>Redirecting to portal...</p>";
  html += "</body></html>";
  
  server.send(200, "text/html", html);
}

