TheWrew-Git/ProjectBookmark/RO4M1NG_L1BR4RY/ESP32/build_adafruit/sketch/RO4M1NG_L1BR4RY_adafruit.ino.cpp
void handleNotFound() {
  // If this is a desktop browser request to an external domain
  if (!isIp(server.hostHeader()) && server.hostHeader() != WiFi.softAPIP().toString()) {
    // JavaScript redirect + meta refresh for desktop browsers
    String html = "<!DOCTYPE html><html><head>";
    html += "<script>window.location.replace('http://" + toStringIp(apIP) + "');</script>";
    html += "<meta http-equiv='refresh' content='0;url=http://" + toStringIp(apIP) + "'>";
    html += "</head><body>";
    html += "<p>Redirecting to portal...</p>";
    html += "</body></html>";
    
    server.send(200, "text/html", html);
    return;
  }
  
  // If it's a direct IP request or a specific path we don't handle
  handleRoot();
}

void handleCaptivePortal() {
    String html = "<html><head>";
    html += "<meta name='viewport' content='width=device-width, initial-scale=1'>";
    html += "<style>";
    html += "body {";
    html += "  font-family: 'Courier New', monospace;";
    html += "  background-color: #000;";
    html += "  color: #0f0;";
    html += "  margin: 0;";
    html += "  padding: 0;";
    html += "  height: 100vh;";
    html += "  display: flex;";
    html += "  flex-direction: column;";
    html += "  justify-content: center;";
    html += "  align-items: center;";
    html += "  overflow: hidden;";
    html += "}";
    html += ".container {";
    html += "  text-align: center;";
    html += "  animation: pulse 2s infinite;";
    html += "  z-index: 2;";
    html += "  position: relative;";
    html += "}";
    html += "@keyframes pulse {";
    html += "  0% {transform: scale(1);}";
    html += "  50% {transform: scale(1.05);}";
    html += "  100% {transform: scale(1);}";
    html += "}";
    html += "h1 {";
    html += "  color: #0f0;";
    html += "  text-shadow: 0 0 10px #0f0;";
    html += "  text-transform: uppercase;";
    html += "  font-size: 8vw;";
    html += "  margin: 0;";
    html += "}";
    html += ".enter-btn {";
    html += "  display: inline-block;";
    html += "  background: #000;";
    html += "  color: #0f0;";
    html += "  border: 3px solid #0f0;";
    html += "  padding: 15px 30px;";
    html += "  font-size: 6vw;";
    html += "  text-decoration: none;";
    html += "  margin-top: 30px;";
    html += "  animation: glow 1.5s infinite alternate;";
    html += "  transition: all 0.3s ease;";
    html += "}";
    html += ".enter-btn:hover {";
    html += "  background: #0f0;";
    html += "  color: #000;";
    html += "  transform: scale(1.05);";
    html += "}";
    html += "@keyframes glow {";
    html += "  from {box-shadow: 0 0 10px #0f0;}";
    html += "  to {box-shadow: 0 0 20px #0f0, 0 0 30px #0f0;}";
    html += "}";
    html += ".scan {";
    html += "  position: absolute;";
    html += "  height: 5px;";
    html += "  background: rgba(0,255,0,0.5);";
    html += "  width: 100%;";
    html += "  top: 0;";
    html += "  box-shadow: 0 0 20px #0f0;";
    html += "  animation: scan 2s linear infinite;";
    html += "}";
    html += "@keyframes scan {";
    html += "  0% {top: 0;}";
    html += "  100% {top: 100%;}";
    html += "}";
    html += ".grid {";
    html += "  position: fixed;";
    html += "  top: 0;";
    html += "  left: 0;";
    html += "  right: 0;";
    html += "  bottom: 0;";
    html += "  background: linear-gradient(rgba(0,15,0,0.3) 1px, transparent 1px),";
    html += "              linear-gradient(90deg, rgba(0,15,0,0.3) 1px, transparent 1px);";
    html += "  background-size: 30px 30px;";
    html += "  z-index: 1;";
    html += "}";
    html += "</style>";
    html += "</head><body>";
    html += "<div class='grid'></div>";
    html += "<div class='scan'></div>";
    html += "<div class='container'>";
    html += "<h1>CONNECTING...</h1>";
    html += "<a href='http://" + WiFi.softAPIP().toString() + "' class='enter-btn'>ACCESS</a>";
    html += "</div>";
    html += "</body></html>";
    server.send(200, "text/html", html);
}

void handlePortal() {
    String html = "<html><head>";
    html += "<meta name='viewport' content='width=device-width, initial-scale=1'>";
    html += "<style>";
    html += "body { font-family: 'Courier New', monospace; background-color: #000; color: #0f0; margin: 20px; line-height: 1.6; }";
    html += "h1 { color: #0f0; text-shadow: 0 0 5px #0f0; text-transform: uppercase; text-align: center; }";
    html += ".container { text-align: center; margin-top: 50px; }";
    html += ".enter-btn { display: inline-block; background: #000; color: #0f0; border: 1px solid #0f0; padding: 15px 30px; font-size: 1.2em; text-decoration: none; margin-top: 20px; }";
    html += ".enter-btn:hover { background: #0f0; color: #000; }";
    html += "</style>";
    html += "</head><body>";
    html += "<div class='container'>";
    html += "<h1>PR0J3KT B00KM4RK</h1>";
    html += "<a href='http://192.168.4.1/library' class='enter-btn'>TO ENTER LIBRARY</a>";
    html += "</div>";
    html += "<div style='text-align: center;'>";
    html += "<h4>Accept Sign-In (may vary by device). Open browser and navigate to 192.168.4.1</h4>";
    html += "</div>";
    html += "</body></html>";
    server.send(200, "text/html", html);
}

void handleFileList() {
   /*
   // Disconnect any existing peer connections when viewing the list
   for (const auto& peer : peers) {
       disconnectFromPeer(peer.mac);
   }
   */

   server.setContentLength(CONTENT_LENGTH_UNKNOWN);
   server.send(200, "text/html", "");

   // First part - HTML Header
   static const char HTML_HEAD[] PROGMEM = R"=====(
   <html><head>
   <meta name='viewport' content='width=device-width, initial-scale=1'>
   <style>
   body { 
       font-family: 'Courier New', monospace; 
       background-color: #000; 
       color: #0f0; 
       margin: 20px; 
       line-height: 1.6; 
   }
   h1, h2, h3 { 
       color: #0f0; 
       text-shadow: 0 0 5px #0f0; 
       text-transform: uppercase; 
       text-align: center; 
   }
   a { 
       color: #0f0; 
       text-decoration: none; 
   }
   a:hover { 
       color: #fff; 
       text-shadow: 0 0 10px #0f0; 
   }
   .container { 
       border: 1px solid #0f0; 
       padding: 20px; 
       margin: 10px 0; 
       box-shadow: 0 0 10px #0f0; 
   }
   .node-item { 
       border-left: 3px solid #0f0; 
       padding: 10px; 
       margin: 10px 0;
       display: flex;
       justify-content: space-between;
       align-items: center;
       transition: all 0.3s ease;
   }
   .node-item:hover { 
       background-color: #001100; 
       transform: translateX(5px);
   }
   .node-info {
       flex-grow: 1;
   }
   .connect-btn {
       padding: 5px 15px;
       border: 1px solid #0f0;
       margin-left: 20px;
       transition: all 0.3s ease;
   }
   .connect-btn:hover {
       background: #0f0;
       color: #000;
   }
   .node-status {
       color: #0a0;
       font-size: 0.9em;
       margin-top: 5px;
   }
   .loader {
       display: none;
       width: 20px;
       height: 20px;
       border: 2px solid #0f0;
       border-radius: 50%;
       border-top-color: transparent;
       animation: spin 1s linear infinite;
       margin-left: 10px;
   }
   @keyframes spin {
       to {transform: rotate(360deg);}
   }
   </style>
   <script>
   function connect(nodeId) {
       const loader = document.getElementById('loader-' + nodeId);
       const btn = document.getElementById('btn-' + nodeId);
       const status = document.getElementById('status-' + nodeId);
       
       loader.style.display = 'inline-block';
       btn.style.display = 'none';
       status.textContent = '[CONNECTING...]';
       
