TheWrew-Git/ProjectBookmark/RO4M1NG_L1BR4RY/ESP32/build_adafruit/sketch/RO4M1NG_L1BR4RY_adafruit.ino.cpp
       // Redirect to node files page
       window.location.href = '/node-files?node=' + nodeId;
   }
   </script>
   </head><body>
   <div class='container'>
   <h3>//404 D3W3Y N07 F0UND//</h3>
   )=====";

   server.sendContent_P(HTML_HEAD);

   // Local node
   String localNode = "<div class='node-item'>";
   localNode += "<div class='node-info'>&gt; NODE: " + String(AP_SSID) + " [LOCAL] &lt;</div>";
   localNode += "<a href='/node-files?node=" + String(AP_SSID) + "' class='connect-btn'>CONNECT</a>";
   localNode += "</div>";
   server.sendContent(localNode);
   yield();

   // Remote nodes
   /*
   int nodeCount = 0;
   for (const auto& peer : peers) {
       String nodeHtml = "<div class='node-item'>";
       nodeHtml += "<div class='node-info'>&gt; NODE: " + peer.ssid + " &lt;";
       nodeHtml += "<div class='node-status' id='status-" + peer.ssid + "'>[AVAILABLE]</div></div>";
       nodeHtml += "<div class='loader' id='loader-" + peer.ssid + "'></div>";
       nodeHtml += "<a href='javascript:void(0)' onclick='connect(\"" + peer.ssid + "\")' ";
       nodeHtml += "class='connect-btn' id='btn-" + peer.ssid + "'>CONNECT</a>";
       nodeHtml += "</div>";
       server.sendContent(nodeHtml);
       
       if (++nodeCount % 5 == 0) {
           yield();
       }
   }
   */

   // Last part - HTML Footer
   static const char HTML_FOOTER[] PROGMEM = R"=====(
   <div style='text-align: center;'>
   <br><a href='/'>&lt;&lt; Return to Terminal &gt;&gt;</a>
   </div>
   </div></body></html>
   )=====";

   server.sendContent_P(HTML_FOOTER);
   finalizeChunkedResponse();
}

void handleNodeFiles() {
    String nodeSSID = server.arg("node");
    String section = server.arg("section");
    bool isLocal = true; // local files only
    
    // Start sending headers immediately to improve responsiveness
    server.setContentLength(CONTENT_LENGTH_UNKNOWN);
    server.send(200, "text/html", "");

    // Send HTML header with enhanced cyberpunk styles while keeping CSS compact
    server.sendContent(F(
      "<!DOCTYPE html><html><head><meta name='viewport' content='width=device-width, initial-scale=1'>"
      "<style>"
      "body{background:#000;color:#0f0;font-family:monospace;margin:0;padding:0;min-height:100vh;overflow-x:hidden}"
      "h1,h2,h3{color:#0f0;text-shadow:0 0 5px #0f0;text-transform:uppercase;text-align:center}"
      "a{color:#0f0;text-decoration:none;transition:all .2s}"
      "a:hover{color:#fff;text-shadow:0 0 10px #0f0}"
      ".container{border:1px solid #0f0;padding:15px;margin:10px auto;box-shadow:0 0 15px #0f0;max-width:800px;width:90%;position:relative;z-index:1;background:rgba(0,10,0,0.7)}"
      ".file-list{max-height:70vh;overflow-y:auto;border:1px solid #0f0;margin:10px 0;padding:5px;background:rgba(0,5,0,0.5)}"
      ".file-list::-webkit-scrollbar{width:5px;background:#000}"
      ".file-list::-webkit-scrollbar-thumb{background:#0f0}"
      ".file-item{border-left:3px solid #0f0;padding:8px;margin:5px 0;transition:all .2s;background:rgba(0,10,0,0.4)}"
      ".file-item:hover{background:#001500;transform:translateX(5px);box-shadow:0 0 10px #0f0}"
      ".nav-bar{display:flex;justify-content:space-between;align-items:center;margin:10px 0;padding:8px;border:1px solid #0f0;background:rgba(0,10,0,0.5)}"
      ".nav-button{padding:5px 15px;border:1px solid #0f0;transition:all .2s;background:rgba(0,20,0,0.6)}"
      ".nav-button:hover{background:#0f0;color:#000;box-shadow:0 0 10px #0f0}"
      ".section-list{display:grid;grid-template-columns:repeat(auto-fill,minmax(60px,1fr));gap:10px;padding:15px;border:1px solid #0f0;margin:15px 0;background:rgba(0,10,0,0.5)}"
      ".section-button{text-align:center;padding:5px;border:1px solid #0f0;transition:all .2s;background:rgba(0,15,0,0.6)}"
      ".section-button:hover{background:#0f0;color:#000;transform:scale(1.05);box-shadow:0 0 10px #0f0}"
      // Cyberpunk grid background
      ".cyber-grid{position:fixed;top:0;left:0;right:0;bottom:0;background:linear-gradient(rgba(0,15,0,0.2) 1px, transparent 1px),linear-gradient(90deg, rgba(0,15,0,0.2) 1px, transparent 1px);background-size:20px 20px;z-index:-1}"
      // Scanning effect  
      ".cyber-scan{position:fixed;top:0;left:0;right:0;height:3px;background:rgba(0,255,0,0.5);box-shadow:0 0 10px #0f0;animation:scan 20s linear infinite;z-index:0}"
      "@keyframes scan{0%{top:0}100%{top:100%}}"
      ".title{text-shadow:0 0 10px #0f0;letter-spacing:2px;margin:10px 0;font-weight:bold}"
      // Loading indicator that doesn't block rendering
      ".loading{position:fixed;bottom:10px;right:10px;padding:5px 10px;background:rgba(0,10,0,0.8);border:1px solid #0f0;display:none;animation:pulse 1.5s infinite;z-index:100}"
      "@keyframes pulse{0%{opacity:.7}50%{opacity:1}100%{opacity:.7}}"
      "</style>"
      "<script>"
      "function showLoading(show){document.querySelector('.loading').style.display=show?'block':'none'}"
      "window.addEventListener('beforeunload',function(){showLoading(true)})"
      "</script>"
      "</head><body>"
      "<div class='cyber-grid'></div><div class='cyber-scan'></div>"
      "<div class='loading'>PR0C3551NG...</div>"
    ));

    // Send container opening
    server.sendContent(F("<div class='container'>"));

    // Send the title with cyberpunk styling
    server.sendContent("<h3 class='title'>//N0D3: " + nodeSSID + "//</h3>");

    // Cached directory path calculation outside conditions
    String dirPath = "/Alexandria/";
    
    if (section == "") {
        // Send section buttons (alphabetical navigation)
        server.sendContent(F("<div class='section-list'>"));
        server.sendContent(F("<a href='/node-files?node="));
        server.sendContent(nodeSSID + F("&section=num' class='section-button' onclick='showLoading(true)'>[0-9]</a>"));
        server.sendContent(F("<a href='/node-files?node="));
        server.sendContent(nodeSSID + F("&section=sym' class='section-button' onclick='showLoading(true)'>[#@]</a>"));
        
        // Send A-Z section buttons in chunks to avoid long operations
        for (char c = 'A'; c <= 'M'; c++) { // First half of alphabet
            server.sendContent(F("<a href='/node-files?node="));
            server.sendContent(nodeSSID + F("&section="));
            server.sendContent(String(c) + F("' class='section-button' onclick='showLoading(true)'>["));
            server.sendContent(String(c) + F("]</a>"));
            yield(); // Allow system to process
        }
        
        for (char c = 'N'; c <= 'Z'; c++) { // Second half of alphabet
            server.sendContent(F("<a href='/node-files?node="));
            server.sendContent(nodeSSID + F("&section="));
            server.sendContent(String(c) + F("' class='section-button' onclick='showLoading(true)'>["));
            server.sendContent(String(c) + F("]</a>"));
            yield(); // Allow system to process
        }
        
