TheWrew-Git/ProjectBookmark/RO4M1NG_L1BR4RY/ESP32/build_adafruit/sketch/RO4M1NG_L1BR4RY_adafruit.ino.cpp
        server.sendContent(F("</div>"));

        // Navigation bar
        server.sendContent(F("<div class='nav-bar' style='text-align:center;'><div style='display:inline-block;'>"));
        server.sendContent(F("<a href='/' class='nav-button' onclick='showLoading(true)'>&lt;&lt; R37URN 70 73RM1N4L &gt;&gt;</a>"));
        server.sendContent(F("</div></div>"));
    } else {
        // Show specific section files
        std::vector<String> sectionFiles;
        String sectionTitle;

        // Determine directory path and section title - do this calculation once
        if (section == "num") {
            dirPath += "0-9";
            sectionTitle = "[0-9]";
        } else if (section == "sym") {
            dirPath += "#@";
            sectionTitle = "[5YM80L5]";
        } else if (section.length() == 1) {
            dirPath += section;
            sectionTitle = "[" + section + "]";
        }

        // Navigation bar at top - send immediately
        server.sendContent(String("<div class='nav-bar'><span class='section-title'>") +
                           sectionTitle +
                           " F1L35</span></div>");
        
        // Start file list container
        server.sendContent(F("<div class='file-list'>"));

        // More efficient file reading with limited yields
        if (isLocal) {
            File dir = SD.open(dirPath);
            int fileCount = 0;
            
            if (dir) {
                // First count how many files we have (faster than using vectors for large directories)
                int totalFiles = 0;
                while (File entry = dir.openNextFile()) {
                    if (!entry.isDirectory() && isAllowedFile(String(entry.name()))) {
                        totalFiles++;
                    }
                    entry.close();
                    
                    // Only yield occasionally during counting to maintain responsiveness
                    if (totalFiles % 10 == 0) {
                        yield();
                    }
                }
                
                // Reset directory pointer
                dir.close();
                dir = SD.open(dirPath);
                
                if (totalFiles == 0) {
                    // No files - send this information immediately
                    server.sendContent(F("<div class='file-item'>[N0 F1L35 F0UND]</div>"));
                } else {
                    // Read and send files in batches for better performance
                    const int BATCH_SIZE = 10; // Process 10 files before yielding
                    int batchCount = 0;
                    
                    while (File entry = dir.openNextFile()) {
                        if (!entry.isDirectory()) {
                            String fileName = String(entry.name());
                            if (isAllowedFile(fileName)) {
                                String fullPath = section + "/" + fileName;
                                String encodedPath = urlEncodePath(fullPath);

                                String html = "<div class='file-item'><a href='/download?file=";
                                html += encodedPath;
                                html += "' onclick='showLoading(true)'>&gt; " + fileName + " &lt;</a></div>";

                                server.sendContent(html);
                                fileCount++;

                                batchCount++;
                                if (batchCount >= BATCH_SIZE) {
                                    yield();
                                    batchCount = 0;
                                }
                            }
                        }
                        entry.close();
                    }
                    
                    // Update section title with file count
                    server.sendContent("<script>document.querySelector('.section-title').innerHTML += ' [" +
                                       String(fileCount) +
                                       " F1L35]';</script>");
                }
                
                dir.close();
            } else {
                server.sendContent(F("<div class='file-item'>[D1R3C70RY N07 F0UND]</div>"));
            }
        }
        
        server.sendContent(F("</div>"));

        // Navigation bar at bottom
        server.sendContent("<div class='nav-bar'>");
        server.sendContent("<a href='/node-files?node=" + nodeSSID +
                           "' class='nav-button' onclick='showLoading(true)'>&lt;&lt; 53C710N5</a>");
        server.sendContent("</div>");
    }

    // Close container and HTML
    server.sendContent(F("</div>"));
    
    // Add a script to hide loading indicator when page is loaded
    server.sendContent(F("<script>window.onload = function(){showLoading(false)}</script>"));
    server.sendContent(F("</body></html>"));
    finalizeChunkedResponse();
}

void handleFileDownload() {
    if (!server.hasArg("file")) {
        server.send(400, "text/plain", "File parameter missing");
        return;
    }

    String fileName = server.arg("file");

    // ✅ Strip path to get only the actual filename
    String baseName = fileName.substring(fileName.lastIndexOf('/') + 1);

    // ✅ Run extension check on the base filename only
    if (!isAllowedFile(baseName)) {
        server.send(400, "text/plain", "Invalid file type. Only PDF, EPUB, DOC, DOCX, RTF, and TXT files are allowed.");
        return;
    }

    String filePath = "/Alexandria/" + fileName;
    if (!SD.exists(filePath)) {
        server.send(404, "text/plain", "File not found");
        return;
    }

    File file = SD.open(filePath, FILE_READ);
    if (!file) {
        server.send(500, "text/plain", "Failed to open file");
        return;
    }

    String contentType = "application/octet-stream";
    if (baseName.endsWith(".pdf")) {
        contentType = "application/pdf";
    } else if (baseName.endsWith(".epub")) {
        contentType = "application/epub+zip";
    } else if (baseName.endsWith(".doc")) {
        contentType = "application/msword";
    } else if (baseName.endsWith(".docx")) {
        contentType = "application/vnd.openxmlformats-officedocument.wordprocessingml.document";
    } else if (baseName.endsWith(".rtf")) {
        contentType = "application/rtf";
    } else if (baseName.endsWith(".txt")) {
        contentType = "text/plain";
    }

    server.sendHeader("Content-Disposition", "attachment; filename=" + baseName);
    server.sendHeader("Connection", "close");
    server.streamFile(file, contentType);
    file.close();
}


void handleUploadPage() {
    String html = "<html><head>";
    html += "<meta name='viewport' content='width=device-width, initial-scale=1'>";
    html += "<style>";
    html += "body { font-family: 'Courier New', monospace; background-color: #000; color: #0f0; margin: 20px; line-height: 1.6; }";
    html += "h1, h2 { color: #0f0; text-shadow: 0 0 3px #0f0; text-transform: uppercase; text-align: center; }";
    html += "a { color: #0f0; text-decoration: none; }";
    html += "a:hover { color: #fff; text-shadow: 0 0 6px #0f0; }";
    html += ".container { border: 1px solid #0f0; padding: 20px; margin: 10px 0; box-shadow: 0 0 8px rgba(0,255,0,0.6); }";
    html += ".upload-form { width: 75%; margin: 20px auto; text-align: center; }";
    html += "input[type='file'] { display: block; margin: 20px auto; color: #0f0; }";
    html += "input[type='submit'] { background: #000; color: #0f0; border: 1px solid #0f0; padding: 10px 20px; cursor: pointer; }";
    html += ".formats { color: #0a0; margin: 10px 0; }";
    html += ".progress-container { width: 100%; margin: 10px 0; display: none; }";
    html += ".progress { width: 100%; height: 20px; background: #001000; border: 1px solid #0f0; overflow: hidden; }";
    html += ".progress-bar { width: 0%; height: 100%; background: #0f0; transition: width 0.2s; }";
    html += ".progress-text { text-align: center; margin-top: 5px; }";
    html += ".status-area { border: 1px solid #0f0; padding: 10px; margin-top: 20px; display: none; background: rgba(0,10,0,0.5); }";
    html += ".verification-success { color: #0f0; animation: pulse 1.5s infinite; }";
    html += ".verification-failed { color: #f00; }";
    html += "@keyframes pulse { 0% {opacity: 0.7;} 50% {opacity: 1;} 100% {opacity: 0.7;} }";
    html += "</style>";

    // JavaScript for progress tracking and status messages
    html += "<script>";
    html += "function showProgress() {";
    html += "  document.getElementById('progressContainer').style.display = 'block';";
    html += "  document.getElementById('statusArea').style.display = 'block';";
    html += "  document.getElementById('statusMessage').innerHTML = 'UPL04D1NG...';";
    html += "  document.getElementById('submitBtn').disabled = true;";
    html += "  ";
    html += "  const form = document.getElementById('uploadForm');";
    html += "  const formData = new FormData(form);";
    html += "  const fileName = document.getElementById('fileInput').files[0].name;";
    html += "  const xhr = new XMLHttpRequest();";
    html += "  ";
    html += "  xhr.open('POST', '/upload', true);";
    html += "  ";
    html += "  // Track upload progress";
    html += "  xhr.upload.onprogress = function(e) {";
    html += "    if (e.lengthComputable) {";
    html += "      const percent = Math.round((e.loaded / e.total) * 100);";
    html += "      document.getElementById('progressBar').style.width = percent + '%';";
    html += "      document.getElementById('progressText').textContent = percent + '%';";
    html += "      console.log('Upload progress: ' + percent + '%');"; // Debug logging
    html += "    }";
    html += "  };";
    html += "  ";
    html += "  // Handle completion";
    html += "  xhr.onload = function() {";
    html += "    if (xhr.status === 200) {";
    html += "      document.getElementById('statusMessage').innerHTML = 'V3R1FY1NG F1L3...';";
    html += "      setTimeout(function() {";
    html += "        document.getElementById('statusMessage').className = 'verification-success';";
    html += "        document.getElementById('statusMessage').innerHTML = 'F1L3 V3R1F13D SUC3SSFULLY!';";
    html += "        // Wait longer before redirecting - 5 seconds";
    html += "        setTimeout(function() {";
    html += "          window.location.href = '/?filename=' + encodeURIComponent(fileName);";
    html += "        }, 5000);";
    html += "      }, 1500);";
    html += "    } else {";
    html += "      document.getElementById('statusMessage').className = 'verification-failed';";
    html += "      document.getElementById('statusMessage').innerHTML = 'V3R1F1C4710N F41L3D!';";
    html += "      document.getElementById('submitBtn').disabled = false;";
    html += "    }";
    html += "  };";
    html += "  ";
    html += "  // Handle errors";
    html += "  xhr.onerror = function() {";
    html += "    document.getElementById('statusMessage').className = 'verification-failed';";
    html += "    document.getElementById('statusMessage').innerHTML = 'UPL04D F41L3D! CH3CK C0NN3C710N.';";
    html += "    document.getElementById('submitBtn').disabled = false;";
    html += "  };";
    html += "  ";
    html += "  xhr.send(formData);";
    html += "  return false;"; // Prevent regular form submission
    html += "}";
    html += "</script>";
    html += "</head><body>";

    html += "<h2>// D0N473 //</h2>";

    html += "<div class='upload-form'>";
    html += "<form id='uploadForm' method='post' action='/upload' enctype='multipart/form-data' onsubmit='return showProgress()'>";
    html += "<div class='formats'>[AZW|DOC|DOCX|EPUB|FB2]</div>";
    html += "<div class='formats'>[iBOOK|LIB|MOBI|PDB]</div>";
    html += "<div class='formats'>[PDF|PRC|RTF|TXT]</div>";
    html += "<input id='fileInput' type='file' name='file' accept='.pdf,.txt,.rtf,.epub,.azw,.mobi,.lib,.fb2,.prc,.pdb,.ibook,.doc,.docx' required><br>";
    
