TheWrew-Git/ProjectBookmark/RO4M1NG_L1BR4RY/ESP32/build_adafruit/sketch/RO4M1NG_L1BR4RY_adafruit.ino.cpp
    html += "<p style='color:#0ff; font-size:0.9em; padding: 10px; border: 1px dashed #0ff; border-radius: 10px;'>"
        "Trouble uploading? Open your browser of choice and navigate to 192.168.4.1"
        "</p>";

    // Progress display
    html += "<div id='progressContainer' class='progress-container'>";
    html += "<div class='progress'>";
    html += "<div id='progressBar' class='progress-bar'></div>";
    html += "</div>";
    html += "<div id='progressText' class='progress-text'>0%</div>";
    html += "</div>";
    
    // Status area with more visibility
    html += "<div id='statusArea' class='status-area'>";
    html += "<div id='statusMessage'>R34DY</div>";
    html += "</div>";
    
    html += "<input id='submitBtn' type='submit' value='UPLOAD'>";
    html += "</form>";
    html += "</div>";

    html += "<div style='text-align: center;'>";
    html += "<br><a href='/'>&lt;&lt; Return to Terminal &gt;&gt;</a>";
    html += "</div>";
    html += "</body></html>";
    server.send(200, "text/html", html);
}

void handleDisclaimer() {
    String html = "<!DOCTYPE html><html><head>";
    html += "<meta name='viewport' content='width=device-width, initial-scale=1'>";
    html += "<style>";
    html += "body{background-color:#000;color:#0f0;font-family:'Courier New',monospace;margin:0;padding:0;display:flex;justify-content:center;align-items:center;min-height:100vh;overflow-x:hidden}";
    html += "h1,h2,h3{color:#0f0;text-shadow:0 0 5px #0f0;text-transform:uppercase;text-align:center}";
    html += "a{color:#0f0;text-decoration:none}";
    html += "a:hover{color:#fff;text-shadow:0 0 10px #0f0}";
    html += ".container{border:1px solid #0f0;width:90%;max-width:800px;margin:20px;padding:20px;box-shadow:0 0 15px #0f0;position:relative;z-index:1;background:rgba(0,5,0,0.7)}";
    html += ".disclaimer-section{border-left:3px solid #0f0;padding:15px;margin:15px 0;text-align:left;background:rgba(0,10,0,0.4)}";
    html += ".cyber-grid{position:fixed;top:0;left:0;right:0;bottom:0;background:linear-gradient(rgba(0,15,0,0.2) 1px, transparent 1px),linear-gradient(90deg, rgba(0,15,0,0.2) 1px, transparent 1px);background-size:20px 20px;z-index:-1}";
    html += ".cyber-scan{position:fixed;top:0;left:0;right:0;height:3px;background:rgba(0,255,0,0.5);box-shadow:0 0 10px #0f0;animation:scan 3s linear infinite;z-index:0}";
    html += "@keyframes scan{0%{top:0}100%{top:100%}}";
    html += ".back-button{display:inline-block;padding:10px 15px;border:1px solid #0f0;margin-top:20px;transition:all 0.3s ease;background:rgba(0,10,0,0.6);text-align:center}";
    html += ".back-button:hover{background:#0f0;color:#000;box-shadow:0 0 10px #0f0}";
    html += "</style></head><body>";

    // Background elements
    html += "<div class='cyber-grid'></div><div class='cyber-scan'></div>";

    // Main content
    html += "<div class='container'>";
    
    // Title
    html += "<h2>// 5Y573M D15CL41M3R //</h2>";
    
    // Usage terms section
    html += "<div class='disclaimer-section'>";
    html += "<h3>Usage Terms</h3>";
    html += "<p>7H3 R04M1NG L1BR4RY is designed for the sharing of non-copyright protected works and documents that users have the legal right to distribute.</p>";
    html += "<p>By uploading files to this system, you affirm that you have the legal right to distribute them and that they do not violate any applicable copyright laws.</p>";
    html += "</div>";
    
    // Format disclaimer section
    html += "<div class='disclaimer-section'>";
    html += "<h3>Supported Formats</h3>";
    html += "<p>This system supports multiple document formats including: PDF, EPUB, DOC, RTF, TXT, AZW, MOBI, LIB, FB2, PRC, PDB, and iBOOK.</p>";
    html += "<p>Note that some formats (AZW, iBook) are proprietary and may be tied to specific reader ecosystems. We do not guarantee that all devices will be able to read all formats.</p>";
    html += "</div>";
    
    // Security disclaimer section
    html += "<div class='disclaimer-section'>";
    html += "<h3>Security Notice</h3>";
    html += "<p>Files are stored and transferred as-is. The system does not scan for malicious content. Exercise caution when downloading files from unknown sources.</p>";
    html += "<p>Some document formats may contain scripts or external links. We recommend using readers with security features enabled.</p>";
    html += "</div>";
    
    // No liability section
    html += "<div class='disclaimer-section'>";
    html += "<h3>Limitation of Liability</h3>";
    html += "<p>The operators of this system are not responsible for the content of uploaded files or any damages that may result from their use.</p>";
    html += "<p>This system is provided as-is with no warranty. Use at your own risk.</p>";
    html += "</div>";
    
    // Return button
    html += "<div style='text-align:center'>";
    html += "<a href='/' class='back-button'>&lt;&lt; R37URN 70 73RM1N4L &gt;&gt;</a>";
    html += "</div>";
    
    html += "</div>"; // Close container
    html += "</body></html>";

    server.send(200, "text/html", html);
}

void handleFileUpload() {
    if (server.uri() != "/upload") return;
   
    HTTPUpload& upload = server.upload();
     Serial.printf("Status: %d | Filename: %s | Bytes: %d\n", 
                upload.status, 
                upload.filename.c_str(), 
                upload.currentSize);
    static String currentFilePath;
    static size_t totalBytes = 0;
   
    if (upload.status == UPLOAD_FILE_START) {
        String filename = upload.filename;
        if (!isAllowedFile(filename)) {
            return;
        }

        // Determine correct directory based on first character
        String dirPath = "/Alexandria/";
        char firstChar = toupper(filename.charAt(0));
        
        if (isdigit(firstChar)) {
            dirPath += "0-9";
        } else if (isalpha(firstChar)) {
            dirPath += String(firstChar);
        } else {
            dirPath += "#@";
        }

        // Ensure directory exists
        if (!SD.exists(dirPath)) {
            Serial.println("Creating directory: " + dirPath);
            if (!SD.mkdir(dirPath)) {
                Serial.println("Failed to create directory: " + dirPath);
                return;
            }
        }

