TheWrew-Git/ProjectBookmark/RO4M1NG_L1BR4RY/ESP32/build_adafruit/sketch/RO4M1NG_L1BR4RY_adafruit.ino.cpp
        // Open file in correct directory
        currentFilePath = dirPath + "/" + filename;
        Serial.println("Creating file: " + currentFilePath);
        
        // Remove any existing file with same name
        if (SD.exists(currentFilePath)) {
            SD.remove(currentFilePath);
        }
        
        uploadFile = SD.open(currentFilePath, FILE_WRITE);
        totalBytes = 0;
        
        if (!uploadFile) {
            Serial.println("Failed to open file for writing: " + currentFilePath);
            return;
        }
        
    } else if (upload.status == UPLOAD_FILE_WRITE) {
        if (uploadFile) {
            size_t bytesWritten = uploadFile.write(upload.buf, upload.currentSize);
            if (bytesWritten != upload.currentSize) {
                Serial.println("Warning: Bytes written mismatch! Expected: " + 
                               String(upload.currentSize) + ", Actual: " + String(bytesWritten));
            }
            totalBytes += bytesWritten;
        }
    } else if (upload.status == UPLOAD_FILE_END) {
        if (uploadFile) {
            uploadFile.close();
            Serial.println("Upload complete, file size: " + String(totalBytes) + " bytes");
            
            // Verify file is readable and has correct size
            verifyUploadedFile(currentFilePath, totalBytes);
        }
    } else if (upload.status == UPLOAD_FILE_ABORTED) {
        if (uploadFile) {
            uploadFile.close();
            SD.remove(currentFilePath);
            Serial.println("Upload aborted, file deleted: " + currentFilePath);
        }
    }
}

bool verifyUploadedFile(String filePath, size_t expectedSize) {
    File file = SD.open(filePath, FILE_READ);
    if (!file) {
        Serial.println("VERIFICATION FAILED: Cannot open file: " + filePath);
        return false;
    }
    
    size_t fileSize = file.size();
    
    // Check file size
    if (fileSize != expectedSize) {
        Serial.println("VERIFICATION FAILED: Size mismatch for " + filePath + 
                      ". Expected: " + String(expectedSize) + ", Actual: " + String(fileSize));
        file.close();
        return false;
    }
    
    // Read a few bytes to ensure file is readable
    byte testBuf[16];
    size_t bytesRead = file.read(testBuf, min(16, (int)fileSize));
    
    if (bytesRead <= 0 && fileSize > 0) {
        Serial.println("VERIFICATION FAILED: Cannot read from file: " + filePath);
        file.close();
        return false;
    }
    
    file.close();
    Serial.println("VERIFICATION SUCCESSFUL: " + filePath + 
                  " (Size: " + String(fileSize) + " bytes, readable: yes)");
    return true;
}

void handleUpload() {
    if (server.method() != HTTP_POST) {
        server.send(405, "text/plain", "Method Not Allowed");
        return;
    }
   
    String html = "<html><head>";
    html += "<meta name='viewport' content='width=device-width, initial-scale=1'>";
    html += "<style>body{background:#000;color:#0f0;font-family:monospace;text-align:center;margin-top:50px;}</style>";
    html += "</head><body>";
    
    if (server.hasArg("filename")) {
        String filename = server.arg("filename");
        html += "<h2>F1L3 UPL04D 5UCC355FUL!</h2>";
        html += "<p>File '" + filename + "' was successfully uploaded and verified.</p>";
    } else {
        html += "<h2>F1L3 PR0C3553D</h2>";
        html += "<p>Upload complete!</p>";
    }
    
    html += "<p><a href='/'>Return to Terminal</a></p>";
    html += "</body></html>";
    server.send(200, "text/html", html);
}

void handleForum() {
    String html = "<html><head>";
    html += "<meta name='viewport' content='width=device-width, initial-scale=1'>";
    html += "<style>";
    html += "body { font-family: 'Courier New', monospace; background-color: #000; color: #0f0; margin: 20px; line-height: 1.6; }";
    html += "h1, h2 { color: #0f0; text-shadow: 0 0 5px #0f0; text-transform: uppercase; text-align: center; }";
    html += "a { color: #0f0; text-decoration: none; }";
    html += "a:hover { color: #fff; text-shadow: 0 0 10px #0f0; }";
    html += ".container { border: 1px solid #0f0; padding: 20px; margin: 10px 0; box-shadow: 0 0 10px #0f0; }";
    html += ".thread { border: 1px solid #0f0; margin: 10px 0; padding: 10px; }";
    html += ".thread:hover { box-shadow: 0 0 10px #0f0; }";
    html += ".new-thread { text-align: center; margin: 20px; }";
    html += "form { border: 1px solid #0f0; padding: 20px; }";
    html += "input, textarea { background: #000; color: #0f0; border: 1px solid #0f0; padding: 5px; width: 100%; margin: 5px 0; }";
    html += ".cleanup-timer { text-align: center; margin: 20px; padding: 10px; border: 1px solid #0f0; }";

    html += "</style></head><body>";

    html += "<h2>// TERMINAL FORUM //</h2>";

    // Display cleanup timer
    html += "<div class='cleanup-timer'>";
    html += "[NEXT RESET IN: ";
    unsigned long timeLeft = CLEANUP_INTERVAL - (millis() - lastCleanupTime);
    int hoursLeft = timeLeft / 3600000;
    int minutesLeft = (timeLeft % 3600000) / 60000;
    int secondsLeft = (timeLeft % 3600000) / 600000;
    html += String(minutesLeft) + "m " + String(secondsLeft) + "s ]";
    html += "</div>";

    html += "<div class='new-thread'>";
    html += "<div style='text-align: center;'>";
    html += "<a href='/forum/new' style='text-decoration: underline;'>&gt; CREATE NEW THREAD &lt;</a>";
    html += "</div>";
    html += "</div>";

    // Read and display threads
   
    File threadsFile = SD.open("/forum/threads.json", FILE_READ);
    if (threadsFile) {
        String threads = threadsFile.readString();
        threadsFile.close();

        int start = threads.indexOf('[');
        int end = threads.lastIndexOf(']');
        if (start >= 0 && end >= 0) {
            threads = threads.substring(start + 1, end);
            while (threads.length() > 0) {
                int threadEnd = threads.indexOf('}');
                if (threadEnd < 0) break;
               
                String threadData = threads.substring(0, threadEnd + 1);
                String threadId = threadData.substring(threadData.indexOf("\"id\":\"") + 6);
                threadId = threadId.substring(0, threadId.indexOf("\""));
                String threadTitle = threadData.substring(threadData.indexOf("\"title\":\"") + 9);
                threadTitle = threadTitle.substring(0, threadTitle.indexOf("\""));


