TheWrew-Git/ProjectBookmark/RO4M1NG_L1BR4RY/ESP32/build_adafruit/sketch/RO4M1NG_L1BR4RY_adafruit.ino.cpp
    File postsFile = SD.open(postsPath, FILE_READ);
    if (postsFile) {
        String posts = postsFile.readString();
        postsFile.close();

        int start = posts.indexOf('[');
        int end = posts.lastIndexOf(']');
        if (start >= 0 && end >= 0) {
            posts = posts.substring(start + 1, end);
            while (posts.length() > 0) {
                int postEnd = posts.indexOf('}');
                if (postEnd < 0) break;
               
                String postData = posts.substring(0, postEnd + 1);
                postsList.push_back(postData);
                posts = posts.substring(postEnd + 2);
            }
        }
    }

    // Display posts in chronological order
    for (const String& postData : postsList) {
        String author = postData.substring(postData.indexOf("\"author\":\"") + 10);
        author = author.substring(0, author.indexOf("\""));
        String content = postData.substring(postData.indexOf("\"content\":\"") + 11);
        content = content.substring(0, content.indexOf("\""));
        String timestamp = postData.substring(postData.indexOf("\"timestamp\":\"") + 13);
        timestamp = timestamp.substring(0, timestamp.indexOf("\""));

        html += "<div class='post'>";
        html += "<div class='post-header'>";
        html += "[ USER: " + author + " " + formatTimestamp(timestamp.toInt()) + " ]";
        html += "</div>";
        html += "<div class='post-content'>" + content + "</div>";
        html += "</div>";
    }
   
    server.send(200, "text/html", html);
}

void handleNewThread() {
    if (server.method() == HTTP_POST) {
        Serial.println("\n--- Starting New Thread Creation ---");
       
        // Validate form data exists
        if (!server.hasArg("title") || !server.hasArg("content") || !server.hasArg("author")) {
            Serial.println("Error: Missing form data");
            String errorHtml = "<html><head><meta http-equiv='refresh' content='3;url=/forum'></head>";
            errorHtml += "<body>Missing form data. Redirecting...</body></html>";
            server.send(400, "text/html", errorHtml);
            return;
        }

        String title = server.arg("title");
        String content = server.arg("content");
        String author = server.arg("author");
       
        Serial.println("Title: " + title);
        Serial.println("Author: " + author);
        Serial.println("Content length: " + String(content.length()));

        // Generate thread ID first
        String threadId = String(millis());
       
        // Prepare error response HTML
        String errorHtml = "<html><head>";
        errorHtml += "<meta name='viewport' content='width=device-width, initial-scale=1'>";
        errorHtml += "<meta http-equiv='refresh' content='3;url=/forum'>";
        errorHtml += "<style>";
        errorHtml += "body { font-family: 'Courier New', monospace; background-color: #000; color: #0f0; margin: 20px; line-height: 1.6; text-align: center; }";
        errorHtml += "</style></head><body>";
       
        // Ensure directories exist
        if (!SD.exists("/forum")) {
            if (!SD.mkdir("/forum")) {
                Serial.println("Error: Failed to create /forum directory");
                errorHtml += "<p>Failed to create forum directory. Redirecting...</p></body></html>";
                server.send(500, "text/html", errorHtml);
                return;
            }
        }
       
        if (!SD.exists("/forum/posts")) {
            if (!SD.mkdir("/forum/posts")) {
                Serial.println("Error: Failed to create /forum/posts directory");
                errorHtml += "<p>Failed to create posts directory. Redirecting...</p></body></html>";
                server.send(500, "text/html", errorHtml);
                return;
            }
        }

        // Create threads.json if it doesn't exist
        if (!SD.exists("/forum/threads.json")) {
            File threadsFile = SD.open("/forum/threads.json", FILE_WRITE);
            if (threadsFile) {
                threadsFile.println("[]");
                threadsFile.close();
            }
        }

        // Read existing threads
        String threads = "[]";
        File threadsFile = SD.open("/forum/threads.json", FILE_READ);
        if (threadsFile) {
            threads = threadsFile.readString();
            threadsFile.close();
            threads.trim();
            if (!threads.startsWith("[")) {
                threads = "[]";
            }
        }

        // Create new thread JSON
        String newThreadData;
        if (threads == "[]") {
            newThreadData = "[{\"id\":\"" + threadId + "\",";
        } else {
            newThreadData = threads.substring(0, threads.length() - 1) + ",{\"id\":\"" + threadId + "\",";
        }
        newThreadData += "\"title\":\"" + title + "\",";
        newThreadData += "\"author\":\"" + author + "\",";
        newThreadData += "\"timestamp\":\"" + String(millis()) + "\"}]";

        // Write new thread data
        SD.remove("/forum/threads.json");
        threadsFile = SD.open("/forum/threads.json", FILE_WRITE);
        if (!threadsFile) {
            Serial.println("Error: Failed to open threads.json for writing");
            errorHtml += "<p>Failed to create thread file. Redirecting...</p></body></html>";
            server.send(500, "text/html", errorHtml);
            return;
        }
       
        threadsFile.print(newThreadData);
        threadsFile.close();

        // Create initial post file
        String postPath = "/forum/posts/" + threadId + ".json";
        File postFile = SD.open(postPath, FILE_WRITE);
        if (!postFile) {
            Serial.println("Error: Failed to create post file");
            errorHtml += "<p>Failed to create post file. Redirecting...</p></body></html>";
            server.send(500, "text/html", errorHtml);
            return;
        }

        String postData = "[{\"id\":\"" + String(millis()) + "\",";
        postData += "\"author\":\"" + author + "\",";
        postData += "\"content\":\"" + content + "\",";
        postData += "\"timestamp\":\"" + String(millis()) + "\"}]";
       
