TheWrew-Git/ProjectBookmark/RO4M1NG_L1BR4RY/ESP32/build_adafruit/sketch/RO4M1NG_L1BR4RY_adafruit.ino.cpp
        postFile.print(postData);
        postFile.close();

        // Success - redirect to new thread
        server.sendHeader("Location", "/forum/thread?id=" + threadId);
        server.send(303);
        return;
    }

    // Show the new thread form
    String html = "<html><head>";
    html += "<meta name='viewport' content='width=device-width, initial-scale=1'>";
    html += "<style>";
    html += "body { font-family: 'Courier New', monospace; background-color: #000; color: #0f0; margin: 20px; line-height: 1.6; }";
    html += "h1, h2 { color: #0f0; text-shadow: 0 0 5px #0f0; text-transform: uppercase; text-align: center; }";
    html += "a { color: #0f0; text-decoration: none; }";
    html += "a:hover { color: #fff; text-shadow: 0 0 10px #0f0; }";
    html += "form { border: 1px solid #0f0; padding: 20px; margin-top: 20px; }";
    html += "input, textarea { background: #000; color: #0f0; border: 1px solid #0f0; padding: 5px; width: 100%; margin: 5px 0; }";
    html += "input[type='submit'] { cursor: pointer; }";
    html += "input[type='submit']:hover { background: #0f0; color: #000; }";
    html += "</style></head><body>";
   
    html += "<h2>// NEW THREAD //</h2>";
    html += "<form method='post' action='/forum/new'>";  // Added explicit action
    html += "<input type='text' name='author' placeholder='Your Handle' required><br>";
    html += "<input type='text' name='title' placeholder='Thread Title' required><br>";
    html += "<textarea name='content' placeholder='Content' rows='5' required></textarea><br>";
    html += "<input type='submit' value='CREATE THREAD'>";
    html += "</form>";
   
    html += "<div style='text-align: center;'>";
    html += "<br><a href='/forum'>&lt;&lt; Back to Forum &gt;&gt;</a>";
    html += "</div>";
    html += "</body></html>";
   
    server.send(200, "text/html", html);
}

void handleNewPost() {
    if (server.method() == HTTP_POST) {
        String threadId = server.arg("threadId");
        String content = server.arg("content");
        String author = server.arg("author");
       
        // Input validation
        if (threadId.length() == 0 || content.length() == 0 || author.length() == 0) {
            server.send(400, "text/plain", "Missing required fields");
            return;
        }
       
        String postsPath = "/forum/posts/" + threadId + ".json";
       
        // Check if thread exists
        if (!SD.exists(postsPath)) {
            server.send(404, "text/plain", "Thread not found");
            return;
        }
       
        // Read existing posts
        File postsFile = SD.open(postsPath, FILE_READ);
        String currentPosts = "[]";
        if (postsFile) {
            currentPosts = postsFile.readString();
            postsFile.close();
           
            // Validate JSON format
            currentPosts.trim();
            if (!currentPosts.startsWith("[")) {
                currentPosts = "[]";
            }
        }
       
        // Create new post JSON
        String newPost = "{\"id\":\"" + String(millis()) + "\",";
        newPost += "\"author\":\"" + author + "\",";
        newPost += "\"content\":\"" + content + "\",";
        newPost += "\"timestamp\":\"" + String(millis()) + "\"}";
       
        // Prepare updated JSON
        String updatedPosts;
        if (currentPosts == "[]") {
            updatedPosts = "[" + newPost + "]";
        } else {
            updatedPosts = currentPosts.substring(0, currentPosts.length() - 1) + "," + newPost + "]";
        }
       
        // Write updated posts
        SD.remove(postsPath); // Remove old file
        postsFile = SD.open(postsPath, FILE_WRITE);
        if (postsFile) {
            postsFile.print(updatedPosts);
            postsFile.close();
            Serial.println("Post added successfully");
           
            server.sendHeader("Location", "/forum/thread?id=" + threadId + "&scroll=true#bottom");
            server.send(303);
            return;
        } else {
            Serial.println("Failed to write post");
            server.send(500, "text/plain", "Failed to save post");
            return;
        }
    }
   
    server.sendHeader("Location", "/forum");
    server.send(303);
}

void handleToggle() {
    ledState = !ledState;
    digitalWrite(ledPin, ledState);
    server.sendHeader("Location", "/");
    server.send(303);
}
